"""创建一个包括你自己以及前后五名同学的学号列表（共11个学号），分别进行下面的切片操作"""
list=["0231001","0231002","0231003","0231004","0231005","0231090","0231007","0231008","0231009","0231010","0231011"]
#(1) 取最前3个学号
list1=list[0:3]
print("取最前3个学号为")
print(list1)
#(2) 取最后4个学号
list2=list[-4:]
print("取最后4个学号为")
print(list2)
#(3) 从索引3开始，连续取5个学号
list3=list[3:8]
print("从索引3开始，连续取5个学号为")
print(list3)
#(4) 取索引为偶数的学号
list4=list[::2]
print("取索引为偶数的学号为")
print(list4)
#(5) 取你自己以及前后各一名同学的学号
list5=list[5-1:5+2]
print("取你自己以及前后各一名同学的学号为")
print(list5)



